# Все начальные данные задаются произвольно.
# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение

a = 10
b = 5

print(f'a+b = {a + b}')
print(f'a-b = {a - b}')
print(f'a*b = {a * b}')
