# Все начальные данные задаются произвольно.
# Даны действительные числа x и y. Получить x − y / 1 + xy

x = 3
y = 2

print(f'x − y / 1 + xy = {(x-y)/(1+x*y)}')
