# Все начальные данные задаются произвольно.
# Даны катеты прямоугольного треугольника. Найти его гипотенузу и площадь

a = 3
b = 7

print(f'Гипотенуза треугольника с катетами {a} и {b} равна {(a**2 + b**2)**(1/2)}')
print(f'Площадь треугольника с катетами {a} и {b} равна {(a*b)/2}')
