# Все начальные данные задаются произвольно.
# Даны два действительных числа. Найти среднее арифметическое и среднее геометрическое этих чисел

a = 10
b = 20

print(f'среднее арифметическое чисел двух действительных чисел {a} и {b} равно {(a+b)/2}')
print(f'среднее геометрическое чисел двух действительных чисел {a} и {b} равно {(a * b)**(1/2)}')
